.emacs.d/Emacs.org
**** The =my-mod-ef-themes.el= module

#+begin_src emacs-lisp :tangle "my-modules/my-mod-ef-themes.el"
(my-emacs-configure
  (use-package ef-themes)

  (ef-themes-take-over-modus-themes-mode t)

  (setq modus-themes-variable-pitch-ui t
        modus-themes-mixed-fonts t
        modus-themes-bold-constructs t
        modus-themes-italic-constructs t
        modus-themes-to-rotate nil ; defaults to the return value of `modus-themes-get-themes'
        modus-themes-headings ; read the manual's entry of the doc string
        '((0 . (variable-pitch light 1.9))
          (1 . (variable-pitch light 1.8))
          (2 . (variable-pitch regular 1.7))
          (3 . (variable-pitch regular 1.6))
          (4 . (variable-pitch regular 1.5))
          (5 . (variable-pitch 1.4)) ; absence of weight means `bold'
          (6 . (variable-pitch 1.3))
          (7 . (variable-pitch 1.2))
          (agenda-date . (semilight 1.5))
          (agenda-structure . (variable-pitch light 1.9))
          (t . (variable-pitch 1.1))))

  (provide 'my-mod-ef-themes))
#+end_src

**** The =my-mod-doric-themes.el= module

#+begin_src emacs-lisp :tangle "my-modules/my-mod-doric-themes.el"
(my-emacs-configure
  (use-package doric-themes))

(provide 'my-mod-doric-themes)
#+end_src

**** The =my-mod-standard-themes.el= module

#+begin_src emacs-lisp :tangle "my-modules/my-mod-standard-themes.el"
(my-emacs-configure
  (use-package standard-themes)

  (standard-themes-take-over-modus-themes-mode t)

  (setq modus-themes-variable-pitch-ui t
        modus-themes-mixed-fonts t
        modus-themes-to-rotate nil ; defaults to the return value of `modus-themes-get-themes'
	modus-themes-headings ; read the manual's entry of the doc string
        '((0 . (variable-pitch light 1.9))
          (1 . (variable-pitch light 1.8))
          (2 . (variable-pitch regular 1.7))
          (3 . (variable-pitch regular 1.6))
          (4 . (variable-pitch regular 1.5))
          (5 . (variable-pitch 1.4)) ; absence of weight means `bold'
          (6 . (variable-pitch 1.3))
          (7 . (variable-pitch 1.2))
          (agenda-date . (semilight 1.5))
          (agenda-structure . (variable-pitch light 1.9))
          (t . (variable-pitch 1.1)))))

(provide 'my-mod-standard-themes)
#+end_src

**** The =my-mod-theme.el= section to load themes

#+begin_src emacs-lisp :tangle "my-modules/my-mod-theme.el"
(require 'my-mod-modus-themes)
(require 'my-mod-ef-themes)
(require 'my-mod-doric-themes)
(require 'my-mod-standard-themes)
(load-theme 'ef-owl)
#+end_src

*** The =my-mod-theme.el= section for fonts (~fontaine~)

Read the ~fontaine~ manual: <https://protesilaos.com/emacs/fontaine>.

#+begin_src emacs-lisp :tangle "my-modules/my-mod-theme.el"
(my-emacs-configure
  (use-package fontaine)

  (fontaine-mode t)

  (define-key global-map (kbd "C-c f") #'fontaine-set-preset)
  (define-key global-map (kbd "C-c F") #'fontaine-toggle-preset)

  (setq-default text-scale-remap-header-line t)

  (setq fontaine-presets
	'((Aporetic-Sans-Regular
	   :default-height 200
	   :default-family "Aporetic Sans Mono"
	   :fixed-pitch-family "Aporetic Sans Mono"
	   :variable-pitch-family "Aporetic Sans")
	  (Aporetic-Sans-Large
	   :default-height 260
	   :default-family "Aporetic Sans Mono"
	   :fixed-pitch-family "Aporetic Sans Mono"
	   :variable-pitch-family "Aporetic Sans")

          (Aporetic-Serif-Regular
	   :default-height 200
	   :default-family "Aporetic Serif Mono"
	   :fixed-pitch-family "Aporetic Serif Mono"
	   :variable-pitch-family "Aporetic Serif")
	  (Aporetic-Serif-Large
	   :default-height 260
	   :default-family "Aporetic Serif Mono"
	   :fixed-pitch-family "Aporetic Serif Mono"
	   :variable-pitch-family "Aporetic Serif")

	  (t
	   :default-height 200
	   :default-family "Aporetic Serif Mono"
	   :fixed-pitch-family "Aporetic Serif Mono"
	   :variable-pitch-family "Aporetic Serif")
	  ))

  (fontaine-set-preset (or (fontaine-restore-latest-preset) 'regular))

  (with-eval-after-load 'pulsar
    (add-hook 'fontaine-set-preset-hook #'pulsar-pulse-line)))
#+end_src

*** The =my-mod-theme.el= section for ~spacious-padding~

#+begin_src emacs-lisp :tangle "my-modules/my-mod-theme.el"
(when (display-graphic-p)
  (my-emacs-configure
    (use-package spacious-padding)

    (define-key global-map (kbd "<f8>") #'spacious-padding-mode)

    (setq spacious-padding-widths
          `( :internal-border-width 15
             :header-line-width 4
             :mode-line-width 6
             :tab-width 4
             :right-divider-width 15
             :left-fringe-width 8
             :right-fringe-width 20))

    (setq spacious-padding-subtle-frame-lines
          '( :mode-line-active spacious-padding-line-active
             :mode-line-inactive spacious-padding-line-inactive
             :header-line-active spacious-padding-line-active
             :header-line-inactive spacious-padding-line-inactive))

    (when (< emacs-major-version 29)
      (setq x-underline-at-descent-line (when spacious-padding-subtle-frame-lines t))))

  (spacious-padding-mode t))
#+end_src

*** COMMENT The =my-mod-theme.el= section for ~pulsar~

This is yet another package by Protesilaos. This package temporarily highlights your current line after running certain functions.
Read the ~pulsar~ manual: <https://protesilaos.com/emacs/pulsar>.

#+begin_src emacs-lisp :tangle "my-modules/my-mod-theme.el"
(my-emacs-configure
  (use-package pulsar)

  (pulsar-global-mode t)

  (my-emacs-hook
    (next-error-hook minibuffer-setup-hook)
    (pulsar-pulse-line-red pulsar-recenter-top pulsar-reveal-entry))

  (setq pulsar-delay 0.055)
  (setq pulsar-iterations 5)
  (setq pulsar-face 'pulsar-blue)
  (setq pulsar-region-face 'pulsar-yellow)
  (setq pulsar-highlight-face 'pulsar-magenta)

  (define-key global-map (kbd "C-x l") #'pulsar-pulse-line) ; override `count-lines-page'
  (define-key global-map (kbd "C-x L") #'pulsar-highlight-permanently-dwim) ; or use `pulsar-highlight-temporarily-dwim'
  )
#+end_src

*** The =my-mod-theme.el= call to ~provide~

#+begin_src emacs-lisp :tangle "my-modules/my-mod-theme.el"
(provide 'my-mod-theme)
#+end_src

** The =my-mod-essentials.el= module

*** The =my-mod-essentials.el= section for ~delete-selection-mode~

For some crazy reason, Emacs does not automatically delete your selection when you begin typing over it. This mode fixes that.

#+begin_src emacs-lisp :tangle "my-modules/my-mod-essentials.el"
(my-emacs-configure
   (delete-selection-mode t))
#+end_src

*** The =my-mod-essentials.el= section for ~global-auto-revert-mode~

By default, Emacs will not update your buffer even if the underlying file is updated. This mode changes that.

#+begin_src emacs-lisp :tangle "my-modules/my-mod-essentials.el"
(my-emacs-configure
  (global-auto-revert-mode 1)
  (setq auto-revert-verbose t))
#+end_src

*** The =my-mod-essentials.el= section for ~which-key-mode~

Emacs 30 added ~which-key-mode~, which gives you a list of the next keys you can press when you forget a key chord. For example, if I press =C-x= it will suggest =C-x 1= for ~delete-other-windows~.

#+begin_src emacs-lisp :tangle "my-modules/my-mod-essentials.el"
(my-emacs-configure
 (setq which-key-separator "  "
       which-key-prefix-prefix "... "
       which-key-max-display-columns 3
       which-key-idle-delay 1.5
       which-key-idle-secondary-delay 0.25
       which-key-add-column-padding 1
       which-key-max-description-length 40)

 (which-key-mode 1))
#+end_src

*** The =my-mod-essentials.el= hook for ~delete-trailing-whitespace~

If you use ~auto-save-visited-mode~, you may find it annoying that your whitespaces keep getting involuntarily deleted. In such a case, I would recommend binding ~delete-trailing-whitespace~ to =C-x s= or whatever your save keybinding is.

#+begin_src emacs-lisp :tangle "my-modules/my-mod-essentials.el"
(my-emacs-configure
  (add-hook 'before-save-hook #'delete-trailing-whitespace))
#+end_src

*** The =my-mod-essentials.el= bind for ~duplicate-line~

#+begin_src emacs-lisp :tangle "my-modules/my-mod-essentials.el"
(my-emacs-configure
  (define-key my-bind-overrides-mode-map
              (kbd "C-,")
              (lambda ()
		(interactive)
		(duplicate-line)
		(next-line))))
#+end_src

*** The =my-mod-essentials.el= section for ~display-time-mode~

#+begin_src emacs-lisp :tangle "my-modules/my-mod-essentials.el"
(setq display-time-string-forms '((format-time-string "%a %d %b, %H:%M")))
;; (display-time-mode t)
#+end_src

*** The =my-mod-essentials.el= bind for ~other-window~

#+begin_src emacs-lisp :tangle "my-modules/my-mod-essentials.el"
(define-key global-map (kbd "M-o") #'other-window)
#+end_src

*** The =my-mod-essentials.el= section for ~exec-path-path-shell~

When you launch Emacs from a GUI application launcher such as MacOS Spotlight, Emacs will not be able to find the nonstandard directories in your path (for example, packages installed via Homebrew, an unofficial MacOS package manager).

#+begin_src emacs-lisp :tangle "my-modules/my-mod-essentials.el"
(use-package exec-path-from-shell)
(when (memq window-system '(mac ns x pgtk))
  (exec-path-from-shell-initialize))
#+end_src

*** The =my-mod-essentials.el= section for disabling line wrap (~truncate-lines~)

#+begin_src emacs-lisp :tangle "my-modules/my-mod-essentials.el"
(setq truncate-lines t)
#+end_src

*** The =my-mod-essentials.el= section for ~variable-pitch-mode~

#+begin_src emacs-lisp :tangle "my-modules/my-mod-essentials.el"
(my-emacs-configure
  (add-hook 'text-mode #'variable-pitch-mode))
#+end_src

*** The =my-mod-essentials.el= call to ~provide~

#+begin_src emacs-lisp :tangle "my-modules/my-mod-essentials.el"
(provide 'my-mod-essentials)
#+end_src

** The =my-mod-modeline.el= module

*** The =my-mod-modeline.el= section to define format

#+begin_src emacs-lisp :tangle "my-modules/my-mod-modeline.el"
(my-emacs-configure
  (require 'my-lib-modeline)

  (setq-default mode-line-format
		(list
		 "%e"
		 my-modeline-read-only
		 my-modeline-buffer-name
		 "  "
		 my-modeline-major-mode
		 'mode-line-process
		 "  "
		 my-modeline-vc
		 'mode-line-format-right-align
		 my-modeline-multiple-cursors
		 my-modeline-position
		 my-modeline-misc-info)))
#+end_src

*** The =my-mod-modeline.el= call to ~provide~

#+begin_src emacs-lisp :tangle "my-modules/my-mod-modeline.el"
(provide 'my-mod-modeline)
#+end_src

** The =my-mod-git.el= module

*** The =my-mod-git.el= section for =vc.el=

VC refers to "version control", which is what allows you to track your files and visualise changes across different versions of your data.

#+begin_src emacs-lisp :tangle "my-modules/my-mod-git.el"
(my-emacs-configure
 (setq vc-follow-symlinks t)

 (with-eval-after-load 'vc
    ;; I only use Git.  If I ever need another, I will include it here.
    ;; This may have an effect on performance, as Emacs will not try to
    ;; check for a bunch of backends.
    (setq vc-handled-backends '(Git))

    (setq vc-dir-save-some-buffers-on-revert t)))
#+end_src
p

*** The =my-mod-git.el= section for ~magit~

Magit is an amazing package. It can basically do everything the builtin =vc.el= can do, and that's with no setup.
Start by pressing =C-x g= (~magit-status~) to bring up the state of the repository.

#+begin_src emacs-lisp :tangle "my-modules/my-mod-git.el"
(my-emacs-configure
 (use-package magit))
#+end_src

*** The =my-mod-git.el= call to ~provide~

#+begin_src emacs-lisp :tangle "my-modules/my-mod-git.el"
(provide 'my-mod-git)
#+end_src

** The =my-mod-org.el= module

*** The =my-mod-org.el= section to setup ~org-mode~

I like to pull ~org-mode~ straight from the git mirror as to get the cutting-edge version.

#+begin_src emacs-lisp :tangle "my-modules/my-mod-org.el"
(my-emacs-configure
  (use-package org
    :straight (:host github :repo "bzg/org-mode" :branch "main")
    :hook
    (org-mode . visual-line-mode)
    ;; (org-mode . variable-pitch-mode)
    :custom
    (org-use-speed-commands t) ; M-x org-speed-commands-help
    (org-startup-indented t)
    (org-hide-emphasis-markers t)
    (org-cycle-separator-lines 1) ; Keep a line between folded headings
    (org-src-content-indentation 0)
    )

  (my-emacs-hook
   (org-agenda-after-show-hook org-follow-link-hook)
   (pulsar-recenter-center pulsar-reveal-entry)
   nil
   pulsar))
#+end_src

