.emacs.d/Emacs.org
*** The =my-mod-org.el= section for ~org-babel~

~Org-babel~ is what allows for literate configurations like this one.

~Org-tempo~ is very useful for Babel. It allows you to type something like =<el <TAB>= and it will expand into an Emacs Lisp codeblock.

#+begin_src emacs-lisp :tangle "my-modules/my-mod-org.el"
(my-emacs-configure
  (org-babel-do-load-languages
  'org-babel-load-languages
  '((emacs-lisp . t)
    (shell . t)
    ))

 (require 'org-tempo)
 (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
 (add-to-list 'org-structure-template-alist '("sh" . "src shell")))
#+end_src

*** The =my-mod-org.el= section for ~org-roam~

#+begin_src emacs-lisp :tangle "my-modules/my-mod-org.el"
(my-emacs-configure
 (use-package org-roam
   :bind
   ("C-c n c" . org-roam-capture)
   ("C-c n f" . org-roam-node-find)
   ("C-c n i" . org-roam-node-insert)
   :custom (org-capture-bookmark nil)
   :config (org-roam-db-autosync-mode t))

 ;; ":commands" implies defer until the command is run
 (use-package org-roam-ui :commands org-roam-ui-mode))
#+end_src

*** The =my-mod-org.el= call to ~provide~

#+begin_src emacs-lisp :tangle "my-modules/my-mod-org.el"
(provide 'my-mod-org)
#+end_src

** The =my-mod-prog.el= module

This module is to configure packages and parameters relevant to ~prog-mode~.

*When installing programming modes, use ~:defer t~ to avoid them loading preemptively.* I don't know if this does anything, but it's good to be safe.

*** The =my-mod-prog.el= section for ~prog-mode-hook~

#+begin_src emacs-lisp :tangle "my-modules/my-mod-prog.el"
(my-emacs-configure
  ;; Display line numbers
  (setq display-line-numbers-width 3)
  (add-hook 'prog-mode-hook #'display-line-numbers-mode)

  (add-hook 'prog-mode-hook #'hl-line-mode)
  )
#+end_src

*** The =my-mod-prog.el= section for ~eglot~ (LSP client)

~Eglot~ is a client for using LSP (Language Server Protocol) servers. I prefer it over ~lsp-mode~ because it is more lightweight and makes use of builtin Emacs features rather than implementing its own.

#+begin_src emacs-lisp :tangle "my-modules/my-mod-prog.el"
(my-emacs-configure
 (use-package eglot
   :bind
   (:map eglot-mode-map
         ("C-c l a" . eglot-code-actions)
         ("C-c l r" . eglot-rename)
         ("C-c l f" . eglot-format))))
#+end_src

To enable an ~eglot~ for a specific mode, add the following to your configuration. Of course, you must have a supported language server installed first, but that's out of scope for this.

#+begin_example emacs-lisp
(add-hook 'SAMPLE-MAJOR-mode . #'eglot-ensure)
#+end_example

*** The =my-mod-prog.el= section for ~c++-mode~

#+begin_src emacs-lisp :tangle "my-modules/my-mod-prog.el"
(my-emacs-configure
  ;; c++ mode is built in
  (add-hook 'c++-mode-hook #'eglot-ensure))
#+end_src

*** The =my-mod-prog.el= section for ~nix-mode~

#+begin_src emacs-lisp :tangle "my-modules/my-mod-prog.el"
(my-emacs-configure
 (use-package nix-mode :defer t)
 (add-hook 'nix-mode-hook #'eglot-ensure))
#+end_src

*** The =my-mod-prog.el= section for ~haskell-mode~

#+begin_src emacs-lisp :tangle "my-modules/my-mod-prog.el"
(my-emacs-configure
  (use-package haskell-mode)
  (add-hook 'haskell-mode-hook #'eglot-ensure))
#+end_src

*** The =my-mod-prog.el= call to ~provide~

#+begin_src emacs-lisp :tangle "my-modules/my-mod-prog.el"
(provide 'my-mod-prog)
#+end_src

** The =my-mod-text-editing= module

*** The =my-mod-text-editing= module for ~multiple-cursors~

The idea for these keymaps is to keep your fingers on the =CTRL=, =META=, and =hjkl= keys for the majority of the time. The =,= and the =.= are also significant.

#+begin_src emacs-lisp :tangle "my-modules/my-mod-text-editing.el"
(my-emacs-configure
 (use-package multiple-cursors
   :custom
   (mc/always-run-for-all t)
   :config
   (define-key my-bind-overrides-mode-map (kbd "C-M-j") #'mc/mark-all-dwim)
   (define-key my-bind-overrides-mode-map (kbd "C-M-/") #'mc/mark-all-like-this)

   (define-key my-bind-overrides-mode-map (kbd "C-M-,") #'mc/mark-previous-like-this)
   (define-key my-bind-overrides-mode-map (kbd "C-M-.") #'mc/mark-next-like-this)

   (define-key my-bind-overrides-mode-map (kbd "C-<") #'mc/skip-to-previous-like-this)
   (define-key my-bind-overrides-mode-map (kbd "C->") #'mc/skip-to-next-like-this)

   (define-key my-bind-overrides-mode-map (kbd "C-M-c") #'mc/edit-lines)
   (define-key my-bind-overrides-mode-map (kbd "C-M-n") #'mc/insert-numbers)
   (define-key my-bind-overrides-mode-map (kbd "C-M-'") #'mc-hide-unmatched-lines-mode))

  (use-package expreg
    :config
    (define-key my-bind-overrides-mode-map (kbd "C-M-l") #'expreg-expand)
    (define-key my-bind-overrides-mode-map (kbd "C-M-h") #'expreg-contract)))
#+end_src

*** The =my-mod-text-editing= module for ~move-text~

#+begin_src emacs-lisp :tangle "my-modules/my-mod-text-editing.el"
(my-emacs-configure
  (use-package move-text
    :config
    (define-key my-bind-overrides-mode-map (kbd "M-p") #'move-text-up)
    (define-key my-bind-overrides-mode-map (kbd "M-n") #'move-text-down)))
#+end_src

*** The =my-mod-text-editing= module for ~wgrep-mode~

#+begin_src emacs-lisp :tangle "my-modules/my-mod-text-editing.el"
(use-package wgrep
  :bind ((:map grep-mode-map
               ("e" . wgrep-change-to-wgrep-mode)
               ("C-x C-q" . wgrep-change-to-wgrep-mode)
               ("C-c C-c" . wgrep-finish-edit))
         (:map compilation-mode-map
               ("e" . wgrep-change-to-wgrep-mode)
               ("C-x C-q" . wgrep-change-to-wgrep-mode)
               ("C-c C-c" . wgrep-finish-edit))))
#+end_src

*** The =my-mod-text-editing= call to ~provide~

#+begin_src emacs-lisp :tangle "my-modules/my-mod-text-editing.el"
(provide 'my-mod-text-editing)
#+end_src

** The =my-mod-completions= module

*** The =my-mod-completions= sets variables regarding the minibuffer

#+begin_src emacs-lisp :tangle "my-modules/my-mod-completions.el"
(my-emacs-configure
  (savehist-mode t))
#+end_src

*** The =my-mod-completions= submodule for ~vertico~

#+begin_src emacs-lisp :tangle "my-modules/my-mod-completions.el"
(my-emacs-configure
  (use-package vertico
    :config (vertico-mode)
    :custom (vertico-resize t)))

;; straight.el specific
;; make backspace in find-file go up a full directory
(my-emacs-configure
  (use-package vertico-directory
    :after vertico
    :straight nil
    :load-path "straight/repos/vertico/extensions/"
    :bind ( :map vertico-map
            ("RET" . vertico-directory-enter)
            ("DEL" . vertico-directory-delete-char)
            ("M-DEL" . vertico-directory-delete-word))
    :hook (rfn-eshadow-update-overlay . vertico-directory-tidy)))
#+end_src

*** The =my-mod-completions= submodule for ~consult~

I enjoy using =M-s= combined with another keybind in order to create lots of keybinds without using too many slots on the keyboard, and as a bonus it helps all the keybinds feel cohesive.

#+begin_src emacs-lisp :tangle "my-modules/my-mod-completions.el"
(my-emacs-configure
  (use-package consult
    :bind
    ("M-s M-g" . consult-ripgrep)
    ("M-s M-f" . find-file)
    ("M-s M-d" . consult-fd) ; Mnemonic: Search Directory
    ("M-s M-o" . consult-outline)
    ("M-s M-l" . consult-line)
    ("M-s M-b" . consult-buffer)
    ("M-s M-k" . kill-buffer)
    ("M-y" . consult-yank-pop)

    :config
    (setq consult-ripgrep-args "rg --null --line-buffered --color=never --max-columns=1000 --path-separator / --smart-case --no-heading --with-filename --line-number --search-zip --hidden")
    (setq consult-fd-args "fd --full-path --color=never --hidden")

    ;; Don't display these buffers
    (let ((buffers '("*Async-native-compile-log*" "*straight-process*" "*straight-byte-compilation*" "*direnv*" "*Messages*" "*Help*" "*Backtrace*" "*Warnings*" "*Native-compile-Log" "*elfeed-tube-log*")))
      (dolist (buf buffers) (add-to-list 'consult-buffer-filter (regexp-quote buf))))
    (add-to-list 'consult-buffer-filter "\\*EGLOT.*\\*")
    (add-to-list 'consult-buffer-filter "magit.*:"))

  ;; `pulsar' package
  (setq consult-after-jump-hook nil)
  (my-emacs-hook
    consult-after-jump-hook
    (pulsar-recenter-top pulsar-reveal-entry)
    nil
    pulsar))
#+end_src

*** The =my-mod-completions= submodule for miscellaneous minibuffer packages

Here are some packages that improve your ~vertico~ experience:
- Orderless :: A package which allows you to search queries seperated by "-" in any order. For example, ~kill-buffer~ will display even if you type =buffer kill=.
- Marginalia :: This package provides "marginalia", which refers to the convenient information displayed next to vertical minibuffer completions. An example of this is the permissions display next to the filename in ~find-file~.

#+begin_src emacs-lisp :tangle "my-modules/my-mod-completions.el"
(my-emacs-configure
 (use-package marginalia :config (marginalia-mode))

 (use-package orderless :config (setq completion-styles '(orderless basic))))
#+end_src

*** The =my-mod-completions= submodule for ~embark~

#+begin_src emacs-lisp :tangle "my-modules/my-mod-completions.el"
(my-emacs-configure
  (use-package embark
    :bind
    ("C-." . embark-act)
    (:map minibuffer-local-map
          ("C-c C-c" . embark-collect)
          ("C-c C-e" . embark-export)))

  (use-package embark-consult))
#+end_src

*** The =my-mod-completions= submodule for in-buffer completions (~corfu~)

#+begin_src emacs-lisp :tangle "my-modules/my-mod-completions.el"
(my-emacs-configure
 (use-package corfu
   :custom
   (corfu-count 6)
   (corfu-auto-prefix 2)
   :init
   (global-corfu-mode)
   (corfu-popupinfo-mode)
   :hook (prog-mode . (lambda () (setq-local corfu-auto t)))
   :bind (:map corfu-map ("M-SPC" . corfu-insert-separator))))
#+end_src

*** The =my-mod-completions= call to ~provide~

#+begin_src emacs-lisp :tangle "my-modules/my-mod-completions.el"
(provide 'my-mod-completions)
#+end_src

** The =my-mod-elfeed= module

*** The =my-mod-elfeed= setup (~elfeed~ & ~elfeed-tube~)

#+begin_src emacs-lisp :tangle "my-modules/my-mod-elfeed.el"
(my-emacs-configure
  (use-package elfeed
    :bind ("C-x f" . elfeed)
    :hook (elfeed-show-mode . visual-line-mode))

  (use-package elfeed-org
    :config (elfeed-org))

  (use-package elfeed-tube
    :config (elfeed-tube-setup)
    :bind
    (:map elfeed-show-mode-map
          ("F" . elfeed-tube-fetch)
          ([remap save-buffer] . elfeed-tube-save))
    (:map elfeed-search-mode-map
          ("F" . elfeed-tube-fetch)
          ([remap save-buffer] . elfeed-tube-save)))

  (use-package mpv)
  (use-package elfeed-tube-mpv
    :bind
    (:map elfeed-show-mode-map
          ("<return>" . elfeed-tube-mpv)
          ("C-c C-f" . elfeed-tube-mpv-follow-mode)
          ("C-c C-w" . elfeed-tube-mpv-where))))
#+end_src

*** The =my-mod-elfeed.el= load feeds & call to ~provide~

#+begin_src emacs-lisp :tangle "my-modules/my-mod-elfeed.el"
(provide 'my-mod-elfeed)
#+end_src

* The libraries in my configuration (=my-libraries/=)

** The =my-lib-modeline.el= library

This library defines the icons and components of my modeline.
It is based off Protesilaos' =prot-modeline.el= which you can find inside of his Emacs configuration. It is not bundled as a package, which may feel like an inconvenience but I recommend you to take the time to include only parts of his modeline that you *actually need*.

*** The =my-lib-modeline.el= section for icons

#+begin_src emacs-lisp :tangle "my-libraries/my-lib-modeline.el"
(defvar my-major-mode-icons
  '((dired-mode   "")
    (prog-mode    "λ")
    (conf-mode    "Σ")
    (text-mode    "§")
    (t            "·")))

(defun my-major-mode-get-icon ()
  (or
   (cadr (assq major-mode my-major-mode-icons))
   (catch 'icon
     (dolist (entry my-major-mode-icons)
       (when (and (not (eq (car entry) t)) (derived-mode-p (car entry)))
         (throw 'icon (cadr entry)))))
   (cadr (assq t my-major-mode-icons))))
#+end_src

